[
{"url": "http://www.theonion.com/article/man-has-loyalty-pretzel-brand-53164", "description": "BROWNSVILLE, TX—Describing them as “the best pretzels out there” and “the only ones [he] buy[s],” local resident Ned Carlisle expressed his firm loyalty to Snyder’s of Hanover–brand pretzels Tuesday. “I like Snyder’s pretzels best,” said the 45-year-old electric company account manager, bolstering his assertion by stating that the particular brand’s products “just taste better.” “I don’t like Rold Gold. Rold Golds don’t crunch as much. I always get Snyder’s.” Carlisle then concluded his statement with uncharacteristic equivocation, attesting that he had no preference between the mini pretzels and the square ones that are like little waffles.", "title": "Man Has Loyalty To Pretzel Brand"},
{"url": "http://www.theonion.com/article/father-showing-kids-field-dreams-first-time-unawar-53129", "description": "WILKES-BARRE, PA—Oblivious to the intense feelings of arousal coursing through the pre-adolescent’s body, local man Pete Strahl reportedly introduced his children to the film   Monday evening, not knowing that its male lead, played by Kevin Costner, was sparking his son’s sexual awakening. “This is an absolute classic—a real   movie,” said Strahl, handing his 10-year-old a bowl of popcorn as the film’s opening sequence, in which the sweat-drenched protagonist carries a heavy wood-handled hoe through rows of corn, unleashed a string of thoughts and urges in the child’s mind that he had never felt in his life and doesn’t quite understand yet. “The scene at the end always gives me chills. I hope you like it as much as I do.” After the movie was over, Strahl’s son reportedly went up to his bedroom and hesitantly typed the words “Costner in baseball uniform” into Google Images while struggling to grasp what was happening to him.", "title": "Father Showing Kids ‘Field Of Dreams’ For First Time Unaware Kevin Costner Sparking Son’s Sexual Awakening"},
{"url": "http://www.theonion.com/article/nasa-social-media-manager-considers-himself-part-t-53137", "description": "HOUSTON—Calling it a privilege to work in such a dynamic and collaborative environment, NASA social media manager Dustin Greer, 26, told reporters Wednesday he considers himself fortunate to be a part of the space agency’s team. Greer, who for the past four years has helped to maintain NASA’s official Twitter, Facebook, Snapchat, and Instagram accounts, is said to go about his job each day under the impression that, as social media manager, he is one of the thousands of men and women working tirelessly to advance humankind’s exploration of outer space. “Every day at NASA, we’re conducting groundbreaking research and making new discoveries, and it feels incredible being part of something so critical to the future of our society,” said Greer, whose job consists of uploading images, copying and pasting text, shortening links to stay under Twitter’s 140-character limit, and responding to comments online. “Everyone here—from the guys designing new propulsion methods to our astronauts living aboard the International Space Station—plays an important role, and it takes all of us working together to accomplish our missions.”  “We really are a well-oiled machine,” he continued. “It’s enough of a reward just to be surrounded by the type of people who are always challenging and pushing one another to reach greater heights. We really bring out the best in one another.” Citing the   probe’s Pluto flyby and the   rover’s landing on Mars as examples, Greer told reporters it was hard not to take immense pride in the landmark achievements he and his colleagues have made since he was first hired to run NASA’s social media presence. Greer, who majored in communications at DePaul University and joined NASA after a summer marketing internship with the e-commerce site Groupon, added that behind the agency’s awe-inspiring feats are countless long days and sleepless nights that most Americans never see. The employee tasked with curating the agency’s LinkedIn page was also quick to point out that at NASA, he and his fellow staff members are always expected to place the mission ahead of their own personal egos. Greer stressed that whether they are gathering data from space telescopes, devising next-generation technologies to enable extraplanetary habitation, or repromoting posts from the agency’s Tumblr account, neither he nor his coworkers are concerned with claiming individual credit for their contributions. Furthermore, Greer said, he and the agency’s engineers, physicists, and crewmembers were essentially one large family. “Preparing for the last [International Space] Station resupply required all hands on deck,” Greer said of the recent mission, which he documented and shared on Twitter and Instagram using the hashtag #NASASocial. “The technicians were working around the clock to monitor the rocket, the meteorologists were closely assessing atmospheric conditions, and the whole time I was juggling tweets covering the launch with that week’s Periscope tour of the Kennedy Space Center.” “It was so exhausting, but at the same time, it was extremely exciting to have been part of it,” he continued. “Especially the moment when I could just step back and watch the posts go live.” While stating that he thoroughly enjoys his work, Greer admitted to reporters that with so much at stake in their day-to-day operations, he, like everyone at NASA, tends to place an enormous amount of pressure on himself to avoid letting down his colleagues. The man responsible for posting clips of NASA press conferences to YouTube went on to say that when he is feeling burnt out from the demands of the job, he needs only to remind himself of the millions of young Americans who NASA is inspiring every single day. “What I like most about working here is that although this job is incredibly demanding, I get to show up each day knowing we’re really doing something meaningful,” said the man who has the ability to queue up several hours’ worth of social media posts ahead of time, allowing him to sometimes leave work as early as 2 p.m. “It’s enough of a reward just to be surrounded by the type of people who are always challenging and pushing one another to reach greater heights. We really bring out the best in one another.” Added Greer: “This job isn’t for everyone. It’s a high-stress environment, but man, it’s such a payoff when we take a look at everything we’ve accomplished.”", "title": "NASA Social Media Manager Considers Himself Part Of Team"},
{"url": "http://www.theonion.com/article/sitting-inside-cardboard-box-safest-6-year-old-wil-53144", "description": "TOLEDO, OH—Describing how the child entered a state of complete mental serenity free from any stress or anxiety as soon as he closed the flaps of the large shipping carton over him, sources confirmed Thursday that sitting inside his cardboard box is the safest local 6-year-old Kyle Wolfe will feel for the remainder of his life. “Countdown to blastoff,” said the child, who reportedly will not experience a greater sense of security, comfort, or self-assuredness during the next seven decades than he does right now sitting cross-legged between the crayon-covered corrugated walls of his pretend spaceship. “Hold on tight. Let’s explore outer space..” At press time, Wolfe’s father was reportedly tossing the flattened cardboard box into the recycling.", "title": "Sitting Inside Cardboard Box The Safest 6-Year-Old Will Feel For Remainder Of Life"},
{"url": "http://www.theonion.com/article/reince-priebus-smiles-shakes-head-while-flipping-t-53139", "description": "WASHINGTON—Breaking into a smile as he read the words “inclusiveness” and “young voters,” RNC chairman Reince Priebus couldn’t help but shake his head in amusement Wednesday while flipping through an 18-month-old briefing on the Republican Party’s plans for the 2016 election, sources reported. “Oh man, I completely forgot we came up with this whole 20-point program for how we would appeal to Latinos,” said Priebus, chuckling to himself as he thought back on the two years’ worth of meetings that resulted in a detailed strategy of embracing immigration reform, countering the Democrats’ “war on women” rhetoric, and running on a “positive agenda” of hope and tolerance, which he and other GOP leaders had calculated would put their party’s candidate on the best possible footing for this year’s presidential contest. “Wow, and there are our favorable assessments of Jeb Bush and Scott Walker! Boy, oh boy, that really takes me back. You know, all things considered, this was a pretty solid plan for taking back the White House. Oh well.” Priebus went on to state that the briefing wasn’t a complete waste, noting that the section on enacting voting restrictions to subdue minority turnout was still fully usable.", "title": "Reince Priebus Smiles, Shakes Head While Flipping Through Old Briefing On GOP’s Plans For 2016"},
{"url": "http://www.theonion.com/article/financially-struggling-trump-campaign-holds-fundra-53140", "description": "NEWARK, NJ—Having raised only $3.1 million last month despite clinching the Republican nomination and with just $1.3 million on hand, Donald Trump’s presidential campaign sought a much-needed injection of cash Wednesday by holding a fundraising riot in Newark, sources confirmed. “We’re inviting our supporters to join Donald for an afternoon of violent shoving, enraged chanting, and throwing sucker punches, with all proceeds going toward our efforts to make America great again,” said Trump campaign chairman Paul Manafort, explaining that the event included a $50-a-head clash with protesters in the parking lot outside the Prudential Center, where complimentary rocks and glass bottles to throw would be provided. “Gold-level supporters who give over $500 to the campaign will have a reserved spot inside the vicious, uncontrollable scrum in the arena, where they can enjoy brawling with others or screaming racial slurs at the various minorities who will be on hand throughout the event. And our platinum-level donors—those who pledge over $1,000—will be given exclusive access to the press section, where they can knock a camera out of a photographer’s hand or slam a reporter of their choice to the ground. It’s sure to be a lively event.” At press time, the campaign had surpassed its goal of raising $5 million, leading Trump’s advisors to organize a fundraising Molotov cocktail hour outside a Hillary Clinton rally to be held later this week.", "title": "Financially Struggling Trump Campaign Holds Fundraising Riot"},
{"url": "http://www.theonion.com/article/americans-confused-system-government-which-leader--53156", "description": "WASHINGTON—In the wake of Prime Minister David Cameron’s announcement that he would leave office following the United Kingdom’s vote to exit the European Union, tens of millions of Americans expressed their confusion to reporters Friday about a system of government in which a leader would resign after making a terrible decision. “Wait, so he made a really awful choice with far-reaching negative consequences and now he’s just stepping down to let someone else take over? What?” said Colorado Springs, CO resident Evan Austin, echoing the sentiments of citizens across the United States who were left struggling to understand why a democratically elected head of government would relinquish control simply because they had been shown to have made a spectacularly bad judgment call. “So he jeopardized the future of his country, and instead of spending the next several years remaining in power while trying to paper over his mistakes, he’s just gone? Where’s the part where he denies any wrongdoing or tries to blame somebody else? This is absolutely crazy.” The American public noted, however, that they completely understood the part where voters who had made a demonstrably terrible decision continued to double down on it.", "title": "Americans Confused By System Of Government In Which Leader Would Resign After Making Terrible Decision"},
{"url": "http://www.theonion.com/article/hillary-clinton-bowls-over-catcher-score-winning-r-53159", "description": "NEW YORK—Refusing to be denied victory by the 22-year-old intern blocking home plate, presumptive Democratic presidential nominee Hillary Clinton bowled over the opposing team’s catcher to score the winning run in her campaign staff’s softball game Sunday, sources confirmed. The afternoon matchup, held between members of the Clinton campaign as a brief break from the grind of the election season, reportedly came to an end in the bottom of the ninth inning when Clinton sprinted down the third-base line and lowered her shoulder into the chest of the young catcher as he attempted to tag her for the final out. Sources confirmed that the violent collision, which sent both tumbling into the dirt as the ball popped loose, sealed an 8-7 victory for the former senator’s side. “She was running with a full head of steam and absolutely leveled him—you could hear the impact from the dugout,” said senior policy advisor Jake Sullivan, noting that the close play at the plate came only after Clinton had ignored her teammates’ shouts to remain at third base as she tagged up on a shallow flyout to left field. “The kid was doubled over, rolling around and moaning in pain. That’s when everyone ran over to check to see if he was okay.” “The entire time, Secretary Clinton was shouting that he dropped the ball and kept gesturing the ‘safe’ signal,” he added. According to participants, the game-winning play marked the conclusion of what was described as an intense and aggressive performance by Clinton, who reportedly spent most of the game drenched in sweat, covered in dirt, and sporting a bloody lip as a result of diving after a ground ball. In addition to playing with little regard for the safety of herself or those around her, sources confirmed that the former first lady could often be seen taunting opposing players, both verbally and by pointing to the center-field fence before every at-bat. Witnesses also recalled a particularly tense moment midway through the game when Clinton charged from the dugout to angrily confront the game’s lone umpire, political director Amanda Renteria, for ruling a teammate’s outfield hit a foul. According to reports, the presidential candidate then spent approximately five minutes arguing the call as she clenched her crumpled-up baseball cap in her fist before eventually returning to the bench while muttering a string of profanities. Clinton reacted with equal displeasure after striking out in the fifth, when, according to reports, she slammed her bat into the dirt before flinging it against the backstop. “When I was playing second base, she tried to break up a double play by sliding into me with her spikes up,” media advisor Jim Margolis said of Clinton, adding that the former cabinet member also regularly violated the rule prohibiting players from leading on the basepaths. “She brushed herself off like nothing happened, and when I showed her the cut on my leg, she told me to rub some dirt on it and to ‘quit acting like a little pussy.’” “Now that I think about it, she was the only person even wearing cleats,” he added. In addition to clashing with opponents, Clinton frequently directed her frustration toward her own teammates, sources confirmed, often belittling them for fielding errors or poor at-bats. Witnesses said that after chief pollster Joel Benenson bobbled a sharp ground ball hit his way at shortstop, Clinton furiously berated him in front of both teams before ordering him to play right field. Reports also indicated that Clinton refused to allow any of her teammates to pitch, citing her ability to “put some serious spin” on the underhand throws. “By the end of the game, I was trying to steer clear of her in the dugout,” said communications director Jennifer Palmieri, who recalled Clinton kicking over a drink-filled cooler after popping out in the eighth. “She would just sit there at the far end of the bench staring down at the ground. We all knew better than to say anything to her.” “I’m just thankful our team didn’t lose,” she added. As of press time, multiple sources who had participated in the postgame handshake line confirmed that the former secretary of state had definitely spit into her palm.", "title": "Hillary Clinton Bowls Over Catcher To Score Winning Run In Campaign Staff Softball Game"},
{"url": "http://www.theonion.com/article/black-mark-birth-control-manufacturers-record-weig-53158", "description": "LONG BEACH, CA—At approximately 7:05 a.m. Monday, sources at St. Mary Medical Center confirmed that local woman Deliah Zahn gave birth to a healthy black mark on the record of Bayer—manufacturer of the birth control pill Yaz—weighing in at 7 pounds, 6 ounces. “I’m pleased to report the labor and delivery went smoothly, and that both mother and [notable blemish on the efficacy of the widely trusted oral contraceptive] are getting some much-needed rest,” said Dr. Patricia Nguyen, who noted that, aside from some mild jaundice, the glaring evidence of the drug’s failure was completely healthy. “I don’t think we’ll need to keep them here for more than another 24 hours. I’m sure the new parents are excited to get back home and start spending time with their [instance falling within the less than 1 percent of cases in which the pill’s active ingredients are unable to prevent pregnancy].” At press time, sources confirmed that Zahn and her husband had decided to name the exceedingly rare—but still statistically possible—accident “Sophia.”", "title": "Black Mark On Birth Control Manufacturer’s Record Weighs In At 7 Pounds, 6 Ounces"},
{"url": "http://www.theonion.com/article/cash-strapped-trump-forced-replace-eric-trump-chea-53145", "description": "NEW YORK—With his presidential campaign facing a historic funding shortfall that has left it with only $1.3 million on hand, presumptive Republican nominee Donald Trump was reportedly forced to reduce costs this week by replacing Eric Trump with a cheap migrant son. “In order to keep this campaign running smoothly, I had to find some ways to cut back on expenses, which is why I’ve made the tough but necessary decision to part ways with Eric and bring on Javier as my third-born child,” said Trump at a morning press event, placing his hand on the shoulder of the suit-clad 32-year-old Mexican immigrant while explaining that his newly appointed son, who recently arrived in the U.S. without documentation or a work visa, would assume his former son’s place in the family as the younger brother to Donald Jr. and Ivanka. “Eric has been a very good son and done some great work on this campaign, but the fact is that we need to make some adjustments. By replacing him with Javier, I’m getting a good, hardworking, loyal son at a fraction of the cost. It’s a win-win. Plus, Javier loves being here—you can tell he’s so grateful just to have the opportunity to be a Trump.” The presidential candidate added that although he appreciated Javier’s productivity and work ethic, there would likely be no place for him in the Trump family after the migrant son’s seasonal election work ends in November.", "title": "Cash-Strapped Trump Forced To Replace Eric Trump With Cheap Migrant Son"},
{"url": "http://www.theonion.com/article/trump-raises-50-million-fundraiser-where-gop-donor-53152", "description": "WASHINGTON—In an effort to bolster his campaign war chest after reporting historically low levels of cash on hand heading into July, presumptive Republican presidential nominee Donald Trump reportedly raised $50 million at a Thursday night fundraiser dinner in which GOP donors were given the chance to watch him weep for two consecutive hours. “Witnessing Mr. Trump stand hunched over at the dais as tears began streaming down his flushed, contorted face made for a truly wonderful evening, and it was an opportunity I simply could not pass up,” said billionaire industrialist David Koch, a longtime Republican donor who was reportedly one of 200 campaign contributors who paid $250,000 a plate to see the distraught GOP nominee break down into a fit of heavy sobs and occasional moans over the course of 120 minutes in the Grand Ballroom of the Mayflower Hotel. “I know there was incredible demand for tickets to this event, and personally, I would have been willing to pay twice as much as I did to hear him sniffling as he wiped away the tears from his eyes before burying his face in his hands. This was easily the most enjoyable political fundraising event I have attended in decades.” Sources confirmed the campaign is also planning on offering donors who contribute over $5 million the chance to eat dinner alone with Donald Trump while he chokes on a steak.", "title": "Trump Raises $50 Million At Fundraiser Where GOP Donors Get To Watch Him Weep For 2 Hours"},
{"url": "http://www.theonion.com/article/seagull-far-inland-must-be-total-fuckup-53153", "description": "KNOXVILLE, TN—Questioning how the bird could have possibly ended up more than 300 miles from the nearest ocean, sources confirmed Friday that a seagull that was spotted this far inland must be a total fuckup. Several eyewitnesses, who watched the seagull aimlessly wander around a Target parking lot that was located two whole states away from any coastal habitat that could provide proper food, shelter, and protection to the animal, told reporters the bird was more than likely a complete shit-for-brains and a huge fucking embarrassment to its species.  “Wow, that numbskull must have really fucking messed up,” said Erin Hampton, who reportedly saw the sorry-ass seagull pathetically eating smashed-up French fries off of a dirty sidewalk that, she was quick to confirm, was not a goddamn beach. “Come on, dum-dum, get your shit together. The ocean’s that way.” “God, what a shitty bird,” Hampton continued. Numerous sources recalled seeing the seagull loudly squawking for no fucking reason while perched on top of a shopping cart return and speculated that the dimwitted bird probably became lost while trying to migrate with its head up its ass. In addition, sources reported that the dumb-as-a-stump seagull, which they confirmed likely possessed zero fucking natural instincts, probably couldn’t even tell the difference between a body of water and a paved asphalt surface. A number of Knoxville residents informed reporters that the miserable dumbfuck was clearly a complete failure at being a seabird and questioned where the hell the major fuckup expected to build a nest in the middle of a busy strip mall parking lot that lacks sand or grass and is situated seven hours away from a fucking shore. Residents also reportedly assumed that the gull, which was for some reason residing in an entirely landlocked state even though 70 percent of the planet’s goddamn surface is covered with water, absolutely shit the bed at any chance it had at mating. “I bet the rest of the flock just hates this stupid asshole,” said passerby Jason Lowe, shaking his head in disgust before adding that it was probably for the best that the fucking idiot seagull didn’t procreate and pass on its shitty genetic material. “The dumb fucker isn’t even trying to get back to the ocean. Can it even fly? It’s just hopping around like a dope. What the hell is it looking for?” “Christ, you’re not going to find any fish on the cement,” continued Lowe. “Fucking doofus.” At press time, sources confirmed that the goddamn mess of a bird was just flying around in circles above the parking lot like a huge dipshit.", "title": "Seagull This Far Inland Must Be Total Fuckup"},
{"url": "http://www.theonion.com/article/queen-elizabeth-screaming-stockbroker-dump-everyth-53157", "description": "LONDON—Following the United Kingdom’s historic vote to exit the European Union, sources confirmed that Queen Elizabeth II spent Friday frantically screaming at her stockbroker to dump everything. “Just get rid of whatever we have—right now, goddammit!” said Her Royal Highness, who reportedly slammed her fist against a 16th-century desk while shouting at her broker over the phone. “There’s no time, so dump the whole fucking portfolio—all of it—on anybody who will take it. Just hurry the fuck up and do it!” At press time, after speaking with several financial advisors, Queen Elizabeth had gathered the rest of the Royal Family together to inform them they will have to cut back by eliminating servants and start pitching in more around Buckingham Palace.", "title": "Queen Elizabeth Screaming At Stockbroker To Dump Everything"},
{"url": "http://www.theonion.com/article/friend-college-wasted-no-time-becoming-white-colla-52922", "description": "CHARLOTTE, NC—Noting how his fellow 23-year-old now takes business trips and apparently has a company-issued cell phone, local barista Daniel MacKenzie reported Friday that his friend Eric Sanford—with whom MacKenzie attended the University of Virginia from 2011 to 2015—has wasted no time at all becoming a full-fledged white-collar professional. “The last time I saw Eric was at graduation about a year ago, but then we met up for beers last week and he was wearing a button-down shirt and mentioning something about having to move meetings around to see me—boy, he got right into that whole thing real fast,” said MacKenzie, noting that the message from his one-time intramural broom hockey co-captain arranging the meetup for drinks contained an appended email signature identifying him as an “Associate.” “After I told him about how I’m trying to decide whether to go back to school for something or maybe apply for an internship, he complained about how he had to give a presentation to some clients. Then he said he could ‘expense’ the meal. I have no idea how he got to this point.” MacKenzie and Sanford are said to have found some common ground, however, when collectively shaking their heads at how their third roommate, Charles, had wasted no time going back to the job at GameStop he had held back in high school.", "title": "Friend From College Wasted No Time Becoming White-Collar Professional"},
{"url": "http://www.theonion.com/article/area-dad-needs-more-time-museum-plaque-52951", "description": "NEW YORK—Leaning in close to the paragraph of text as his family continued on to the museum’s other exhibits, area dad and Frick Collection visitor Phillip Schermeier, 58, reportedly needed more time with the plaque beside Rembrandt’s 1626 painting  Thursday. “We were already heading over to the Goya stuff, but then we looked back and saw Dad still standing next to the first Rembrandt painting, staring pretty hard at the description on the wall,” said Schermeier’s daughter Laura, noting how her father at several points glanced back and forth between the plaque and the painting as he took in facts about the scene depicting the mythological warrior Palamedes, who helped lead the Greek forces in the Trojan War, genuflecting at the feet of the legendary king of Argos. “His face couldn’t have been much more than a foot away from the plaque, and I think he may have even started nodding a little as he read. I honestly don’t even know how long he was there, because by the time he finished up, we had already moved on to another room.” At press time, Schermeier had reportedly taken out his phone and snapped a picture of a larger multi-paragraph plaque describing Frederic Remington’s process of casting bronze sculptures to read later.", "title": "Area Dad Needs More Time With Museum Plaque"},
{"url": "http://www.theonion.com/article/widower-just-doesnt-have-energy-waltz-dead-wifes-d-52953", "description": "PORTLAND, ME—Saying he felt completely drained after a long and stressful day at work, local widower Harold Stein reported Thursday that he just doesn’t have the energy to waltz with his dead wife’s dress tonight. “Any other night, the first thing I’d do after I finish eating dinner and cleaning up the dishes is light a few candles, take Helen’s favorite gown from the hanger in the old cherry armoire, and slowly dance with it around the living room for a while, but I’m honestly pretty wiped out,” said Stein, adding that he was currently too tired to even consider holding out one sleeve of the dress while slowly twirling around to a staticky vinyl record of the couple’s wedding song, and would probably just kick back on the couch for a bit instead. “Just the thought of getting out her jewelry box and running my hand slowly across her old pearl necklace and then spritzing the room with the perfume she used to wear is making me feel totally exhausted. I’ll definitely still do it on our anniversary, but I just need some time to sit down and recharge right now.” At press time, Stein had reportedly decided to just lay a few articles of his wife’s clothing on the bed next to him and call it an evening.", "title": "Widower Just Doesn’t Have Energy To Waltz With Dead Wife’s Dress Tonight"},
{"url": "http://www.theonion.com/article/family-thought-grandfather-might-enjoy-watching-wo-52966", "description": "BOWLING GREEN, KY—Saying it would be a great opportunity for some sunshine and fresh air, members of the Ostby family reportedly came to the conclusion Friday that their grandfather, Earl Ostby, might enjoy going outside and watching the worst Little League baseball game imaginable. “We just thought he’d get a kick out of seeing six innings of the most god-awful baseball ever played,” said daughter-in-law Danielle Ostby, adding that the 83-year-old would probably love viewing a bunch of uncoordinated second-graders repeatedly fuck up routine throws to first base. “Grandpa doesn’t get out of the nursing home very often, so we felt it would be nice for him to watch two completely shitty teams fail to hit a ball out of the infield and score zero runs. Plus, he finally gets a chance to see his grandson completely embarrass himself for an hour at shortstop.” Ostby told reporters her children would also enjoy spending time with their unresponsive, decrepit grandfather.", "title": "Family Thought Grandfather Might Enjoy Watching Worst Little League Game Imaginable"},
{"url": "http://www.theonion.com/article/man-googling-tender-lump-neck-about-begin-exciting-52972", "description": "NATICK, MA—Entirely unbeknownst to him, 45-year-old local resident Timothy Lang stood on the threshold of an exciting new phase in his life Monday as he typed the phrase “tender lump on neck” into Google’s search bar, sources reported. The simple act of entering the particular set of search terms into his internet browser and pressing the return key on his laptop is said to have suddenly opened a fresh new chapter in the man’s life, one that will soon introduce him to dozens of strangers and scores of novel, indelible experiences, while also fundamentally changing his relationships with friends and family, and leading him to make major alterations to his lifestyle. Further reports indicate that the split second between when he finished typing and the moment his search results appeared onscreen would be the last time Lang recognizes himself as the person he is now, as core aspects of the local bank manager’s very identity will, according to sources, begin to undergo immediate and significant transformations. At press time, Lang was reportedly searching the phrase “tender lump vs. tumor,” an action ironically intended to stem the onrushing deluge of profound life changes, but which will only serve to greatly accelerate his entry into the next phase of his existence.", "title": "Man Googling ‘Tender Lump On Neck’ About To Begin Exciting New Phase In Life"},
{"url": "http://www.theonion.com/article/mom-sleeps-past-sunrise-52973", "description": "WOBURN, MA―Noting that she had somehow managed to sleep through both the dawn chorus of birds and her neighborhood’s early morning garbage pickup, 53-year-old local mother Laura Maloney confirmed that she did not awaken Monday until after the sun had risen. “Oh my gosh, it’s light out already!” said Maloney, adding that she could not believe how late it was and that she would have to leave for work in less than three hours. “I’m so mad at myself. This is going to throw me off and make it impossible to fall asleep at a reasonable time tonight. I’ll probably be up until 9.” Maloney went on to acknowledge that she should have known better than to stay awake to watch all of 60   the previous night.", "title": "Mom Sleeps In Past Sunrise"},
{"url": "http://www.theonion.com/article/family-knows-not-interrupt-dad-while-hes-skimming--52975", "description": "SALISBURY, MD—Taking care to avoid the backyard Sunday afternoon to give the 49-year-old his space, family members of Chuck Learman told reporters they know not to interrupt their dad while he’s skimming the pool and listening to the Baltimore Orioles radio broadcast. “This is Dad’s time, so we try to leave him alone,” said daughter Kelly Learman, 13, referring to the three-hour block every weekend when their father calmly and methodically removes floating debris from the family’s pool with a net on a long pole while the Orioles game plays on a portable radio placed on the patio table. “We’re not supposed to bother him unless it’s an emergency. If you need something, you just get Mom instead.” Sources said that a serene smile could later be seen forming on Learman’s face as he checked on the chlorine levels and silently mouthed the words “put it in the win column” along with play-by-play announcer Joe Angel.", "title": "Family Knows Not To Interrupt Dad While He’s Skimming Pool, Listening To Orioles Radio Broadcast"}